## Plan Result (prod-frontdoor)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ejudiciary-home-apex&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod"
        name                                 = "sdshmcts-prod"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (11 unchanged attributes hidden)

      ~ frontend_endpoint {
          ~ host_name                    = "www.ejudiciary.net" -> "ejudiciary.net"
            id                           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/frontendEndpoints/ejudiciary-home-www"
          ~ name                         = "ejudiciary-home-www" -> "ejudiciary-home-apex"
            # (2 unchanged attributes hidden)
        }
      + frontend_endpoint {
          + host_name                    = "www.ejudiciary.net"
          + name                         = "ejudiciary-home-www"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ejudiciary-home-www",
              + "ejudiciary-home-apex",
            ]
            id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/routingRules/ejudiciary-home-wwwredirect"
          ~ name               = "ejudiciary-home-wwwredirect" -> "ejudiciary-home-apexredirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "ejudiciary-home-www",
            ]
          + name               = "ejudiciary-home-wwwredirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "judiciary.sharepoint.com"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (206 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["ejudiciary-home-apex"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/sdshmcts-prod/frontendEndpoints/ejudiciary-home-apex"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "ejudiciary-net"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":434,"Program":"tfcmt","SHA1":"","Target":"prod-frontdoor","Vars":{}} -->